global/packages.org
* global-packages
search for the related nix package:
do not use unstable; use newest branch:
current: emacs26Packages
** marker
#+begin_src elisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; global-packages
  ;;;;
  ;;
#+end_src
** all-the-icons
#+begin_src elisp
  (use-package all-the-icons)
#+end_src
** ansi-color
#+begin_src elisp
  (use-package ansi-color
    :commands fb/display-ansi-colors
    :config
    (defun fb/display-ansi-colors ()
      (interactive)
      (let ((inhibit-read-only t))
        (ansi-color-apply-on-region (point-min) (point-max))))
    )
#+end_src
** avy
#+begin_src elisp
  (use-package avy)
#+end_src
** calfw
calendar-view
https://github.com/kiwanami/emacs-calfw
#+begin_src elisp
    (use-package calfw
      :config
      (custom-set-faces
       `(cfw:face-title              ((t :foreground ,(fb*getDefaultColorValue :magenta)            :height 2.0                           :weight bold :inherit variable-pitch    )))
       `(cfw:face-header             ((t :foreground ,(fb*getDefaultColorValue :base6)                                                    :weight bold                            )))
       `(cfw:face-sunday             ((t :foreground ,(fb*getDefaultColorValue :base6)  :background ,(fb*getDefaultColorValue :bg)        :weight bold                            )))
       `(cfw:face-saturday           ((t :foreground ,(fb*getDefaultColorValue :base6)  :background ,(fb*getDefaultColorValue :bg)        :weight bold                            )))
       `(cfw:face-holiday            ((t :foreground ,(fb*getDefaultColorValue :base2)  :background ,(fb*getDefaultColorValue :orange)    :weight bold                            )))
       `(cfw:face-grid               ((t :foreground ,(fb*getDefaultColorValue :fg)                                                                                               )))
       `(cfw:face-default-content    ((t :foreground ,(fb*getDefaultColorValue :red)                                                                                              )))
       `(cfw:face-periods            ((t :foreground ,(fb*getDefaultColorValue :red)                                                                                              )))
       `(cfw:face-day-title          ((t                                                :background ,(fb*getDefaultColorValue :bg)                                                )))
       `(cfw:face-default-day        ((t                                                                                                  :weight bold :inherit cfw:face-day-title)))
       `(cfw:face-annotation         ((t :foreground ,(fb*getDefaultColorValue :bg-alt)                                                                :inherit cfw:face-day-title)))
       `(cfw:face-disable            ((t :foreground ,(fb*getDefaultColorValue :blue)                                                                  :inherit cfw:face-day-title)))
       `(cfw:face-today-title        ((t                                                :background ,(fb*getDefaultColorValue :dark-blue) :weight bold                            )))
       `(cfw:face-today              ((t                                                :background ,(fb*getDefaultColorValue :bg)        :weight bold                            )))
       `(cfw:face-select             ((t                                                :background ,(fb*getDefaultColorValue :violet)                                            )))
       `(cfw:face-toolbar            ((t :foreground ,(fb*getDefaultColorValue :bg)     :background ,(fb*getDefaultColorValue :bg)                                                )))
       `(cfw:face-toolbar-button-off ((t :foreground ,(fb*getDefaultColorValue :bg)                                                       :weight bold                            )))
       `(cfw:face-toolbar-button-on  ((t :foreground ,(fb*getDefaultColorValue :bg)                                                       :weight bold                            ))))
      (setq cfw:fchar-junction ?╋
            cfw:fchar-vertical-line ?│
            cfw:fchar-horizontal-line ?━
            cfw:fchar-left-junction ?┣
            cfw:fchar-right-junction ?┫
            cfw:fchar-top-junction ?┯
            cfw:fchar-top-left-corner ?┏
            cfw:fchar-top-right-corner ?┓)
      )
#+end_src
*** cf. [[file:~/.emacs.d/orgmode/misc.org::calfw-org][calfw-org]]
*** combined View
display calendars from different sources
#+begin_src elisp
  (defun fb/open-calendar ()
    (interactive)
    (cfw:open-calendar-buffer
     :contents-sources
     (list
      (cfw:org-create-source                                  (fb*getDefaultColorValue :base8)) ;; orgmode source
      ;; (cfw:howm-create-source                                 (fb*getDefaultColorValue :base7)) ;; howm source
      ;; (cfw:cal-create-source                                  (fb*getDefaultColorValue :base6)) ;; diary source
      ;; (cfw:ical-create-source "Moon" "~/moon.ics"             (fb*getDefaultColorValue :base5)) ;; ICS source1
      ;; (cfw:ical-create-source "gcal" "https://..../basic.ics" (fb*getDefaultColorValue :base4  )) ;; google calendar ICS
      )))
#+end_src
*** other sources must be implemented if needed
#+begin_example elisp
;; (require 'calfw-cal)
;; (require 'calfw-ical)
;; (require 'calfw-howm)
;; (require 'calfw-org)
#+end_example
*** TODO disable line-numbers
*** TODO show calendarWeeksNr
** command-log
#+begin_src elisp
  (use-package command-log-mode)
#+end_src
** dired
#+begin_src elisp
  (use-package dired
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config (setq dired-dwim-target t)
    )
#+end_src
*** all-the-icons-dired
#+begin_src elisp
  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src
*** dired-git-info
;; TODO use after dired-k
#+begin_src elisp
  ;; (use-package dired-git-info
  ;;   :after dired
  ;;   :hook (dired-after-readin . dired-git-info-auto-enable)
  ;;   :config
  ;;   (setq dgi-auto-hide-details-p nil)
  ;;   )
#+end_src
*** dired-hide-dotfiles
#+begin_src elisp
  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    )
#+end_src
*** DEPRECATED dired-k
https://github.com/emacsorphanage/dired-k
shows git status in dired-buffer
#+begin_src elisp
  ;; (use-package dired-k
  ;;   :after dired
  ;;   :hook ((dired-initial-position . dired-k)
  ;; 	 ;; (dired-after-readin     . #'dired-k-no-revert)
  ;; 	 )
  ;;   :config
  ;;   ;; (setq dired-k-style nil)
  ;;   (setq dired-k-style 'git)
  ;;   ;; (setq dired-k-human-readable nil)
  ;;   (setq dired-k-human-readable t)
  ;;   (setq dired-k-padding 1)
  ;;   )
#+end_src
**** TODO only usable after fix: colorscheme and icons
*** dired-rifle
open file with rifle
(dired-rifle)
#+begin_src elisp
  (use-package dired-rifle
    :after dired
    )
#+end_src
*** dired-single
#+begin_src elisp
  (use-package dired-single)
#+end_src
*** fira-code-mode
#+begin_src elisp
  (use-package fira-code-mode
    ;; :config (global-fira-code-mode) ;; will not work with orgmode headline-stars
    :hook prog-mode
    :disabled
    )
#+end_src
*** TODO icons are displayed twice
*** INFO
**** copying
***** to other folder
with ~dired-dwim-target~ set,
open dired
split window
open another dired
=C=
** helpful
#+begin_src elisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key)
    )
#+end_src
** imenu
#+begin_src elisp
  (use-package imenu-list
    ;; TODO enable in each language-mode cf. spacemacs
    ;; :hook (prog-mode . imenu-list-minor-mode)
    ;; :disabled
    )
#+end_src
** inflection
https://github.com/akicho8/string-inflection
#+begin_src elisp
  (use-package string-inflection)
#+end_src
** DEPRECATED neotree
use treemacs instead
#+begin_src elisp
  ;; (use-package neotree
  ;;   :config
  ;;   (setq neo-smart-open t)
  ;;   (setq neo-autorefresh t)
  ;;   (setq neo-vc-integration '(face))
  ;;   )
#+end_src
** no-littering
#+begin_src elisp
  (use-package no-littering
    :init
    (setq no-littering-etc-directory (expand-file-name ".state/config/" user-emacs-directory)
          no-littering-var-directory (expand-file-name ".state/data/"   user-emacs-directory))
    :config
    (setq
     auto-save-file-name-transforms `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))
     backup-by-copying t
     delete-old-versions t          ;;; delete excess backup versions silently
     kept-new-versions 128
     kept-old-versions 0
     make-backup-files t
     vc-follow-symlinks t           ;;; don't ask for confirmation when opening symlinked file under vc
     vc-make-backup-files t         ;;; make backups file even when in version controlled dir
     version-control t              ;;; use version control
     )
    )
#+end_src
** origami
https://github.com/gregsexton/origami.el
#+begin_src elisp
  (use-package origami
    ;; :hook
    )
#+end_src
** CANCELLED popwin
CLOSED: [2021-02-11 Thu 05:35]
:LOGBOOK:
- State "CANCELLED"  from              [2021-02-11 Thu 05:35] \\
  useCase??
:END:
https://github.com/emacsorphanage/popwin
#+begin_src elisp :tangle no
  ;; (use-package popwin)
#+end_src
** rainbow-delimiters
#+begin_src elisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode)
    )
#+end_src
** rainbow-mode
#+begin_src elisp
  (use-package rainbow-mode
    :hook ((prog-mode . rainbow-mode)
           (org-mode . rainbow-mode)
           )
    )
#+end_src
** ripgrep
#+begin_src elisp
  (use-package ripgrep)
#+end_src
** treemacs
#+begin_src elisp
  (use-package treemacs
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
    (progn
      (setq treemacs-collapse-dirs                 (if treemacs-python-executable 3 0)
            treemacs-deferred-git-apply-delay      0.5
            treemacs-directory-name-transformer    #'identity
            treemacs-display-in-side-window        t
            treemacs-eldoc-display                 t
            treemacs-file-event-delay              5000
            treemacs-file-extension-regex          treemacs-last-period-regex-value
            treemacs-file-follow-delay             0.2
            treemacs-file-name-transformer         #'identity
            treemacs-follow-after-init             t
            treemacs-git-command-pipe              ""
            treemacs-goto-tag-strategy             'refetch-index
            treemaca-indentation                   2
            treemacs-indentation-string            " "
            treemacs-is-never-other-window         nil
            treemacs-max-git-entries               5000
            treemacs-missing-project-action        'ask
            treemacs-move-forward-on-expand        nil
            treemacs-no-png-images                 nil
            treemacs-no-delete-other-windows       t
            treemacs-project-follow-cleanup        nil
            treemacs-persist-file                  (expand-file-name ".state/data/treemacs/treemacs-persist" user-emacs-directory)
            treemacs-position                      'left
            treemacs-read-string-input             'from-child-frame
            treemacs-recenter-distance             0.1
            treemacs-recenter-after-file-follow    nil
            treemacs-recenter-after-tag-follow     nil
            treemacs-recenter-after-project-jump   'always
            treemacs-recenter-after-project-expand 'on-distance
            treemacs-show-cursor                   nil
            treemacs-show-hidden-files             t
            treemacs-silent-filewatch              nil
            treemacs-silent-refresh                nil
            treemacs-sorting                       'alphabetic-asc
            treemacs-space-between-root-nodes      t
            treemacs-tag-follow-cleanup            t
            treemacs-tag-follow-delay              1.5
            treemacs-user-mode-line-format         nil
            treemacs-user-header-line-format       nil
            treemacs-width                         35
            treemacs-workspace-switch-cleanup      nil)

      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      ;; (treemacs-follow-mode nil)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)
      (pcase (cons (not (null (executable-find "git")))
                   (not (null treemacs-python-executable)))
        (`(t . t)
         (treemacs-git-mode 'deferred))
        (`(t . _)
         (treemacs-git-mode 'simple))))
    :bind
    (:map global-map
          ("M-0"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t t"   . treemacs)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag))
    ;; :general
    ;; (:keymaps 'treemacs-mode-map
    ;; :states 'treemacs
    ;; "l" 'nil)
    ;; :after general
    )
#+end_src
*** treemacs-all-the-icons
#+begin_src elisp
  (use-package treemacs-all-the-icons
    :after treemacs all-the-icons
    :config
    (treemacs-load-theme "all-the-icons")
    )
#+end_src
*** treemacs-evil
#+begin_src elisp
(use-package treemacs-evil
  :after treemacs evil)
#+end_src
*** treemacs-icons-dired
#+begin_src elisp
  (use-package treemacs-icons-dired
    :after treemacs dired
    :config (treemacs-icons-dired-mode))
#+end_src
*** treemacs-magit
#+begin_src elisp
  (use-package treemacs-magit
    :after treemacs magit)
#+end_src
*** treemacs-persp
#+begin_src elisp
  (use-package treemacs-persp ;;treemacs-persective if you use perspective.el vs. persp-mode
    :after treemacs persp-mode ;;or perspective vs. persp-mode
    :config (treemacs-set-scope-type 'Perspectives))
#+end_src
*** treemacs-projectile
#+begin_src elisp
  (use-package treemacs-projectile
    :after treemacs projectile)
#+end_src
*** CRASH starting Treemacs kills emacs
but lspTremacs is working
** which-key
#+begin_src elisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq
      which-key-idle-delay 0.5
      which-key-max-description-length nil
      which-key-allow-imprecise-window-fit nil
      ;; which-key-popup-type 'minibuffer
      which-key-popup-type 'side-window
      ;; which-key-popup-type 'frame
      which-key-separator " "
      ;; which-key-use-C-h-commands nil
      which-key-use-C-h-commands t
      which-key-sort-order 'which-key-description-order
    ))
#+end_src
*** TODO paging not working
[[file:~/.emacs.d/keys/keybindings.org::*which-key][which-key]]
*** FUNDUS
#+begin_src elisp

  ;; which-key-sort-order 'which-key-key-order-alpha

  ;; which-key-allow-imprecise-window-fit t

  ;; which-key-popup-type 'side-window
  ;; which-key-popup-type 'frame
  ;; which-key-popup-type 'custom
  ;; which-key-custom-show-popup-function

  ;; which-key-side-window-max-height
  ;; which-key-min-display-lines

  ;; which-key-use-C-h-commands t
#+end_src
** writeroom-mode
#+begin_src elisp
  (use-package writeroom-mode
    :config
    (setq writeroom-mode-line-toggle-position 'mode-line-format)
    (setq writeroom-width 98)
    )
#+end_src
